{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, and mounting root for the React app.",
  "frontend/SECURITY.md": "Security guidelines outlining recommended headers and best practices for deploying on the Internet Computer.",
  "frontend/src/App.tsx": "Main app routing configuration with shared layout, header, side menu, floating buttons, and footer.",
  "frontend/src/components/BannerCarousel.tsx": "Auto-playing banner carousel with pause-on-interaction, navigation controls, and responsive image handling.",
  "frontend/src/components/CategoryGrid.tsx": "Grid of category buttons with validated images that navigate to category gallery pages.",
  "frontend/src/components/FloatingContactButtons.tsx": "Fixed-position call and WhatsApp action buttons styled with OKLCH colors.",
  "frontend/src/components/Header.tsx": "Sticky header with menu toggle, brand name, and service location display.",
  "frontend/src/components/icons.tsx": "Exports SVG icon components including hamburger, close, phone, and WhatsApp icons.",
  "frontend/src/components/Lightbox.tsx": "Fullscreen image viewer with keyboard navigation, next/previous controls, and overlay UI.",
  "frontend/src/components/SideMenu.tsx": "Responsive slide-in menu that lists categories, handles outside clicks and Escape key to close, and includes a phone call link.",
  "frontend/src/config/siteData.ts": "Defines site metadata such as brand info, contact details, and a list of decor categories with images.",
  "frontend/src/config/siteMedia.ts": "Provides banner paths and large image galleries grouped by category.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for managing Internet Identity login, stored identity loading, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Empty module noting all data comes from static assets.",
  "frontend/src/hooks/useSeo.ts": "Hook for updating document title and various meta tags including Open Graph and Twitter cards.",
  "frontend/src/index.css": "Tailwind setup with extensive custom theme variables for colors, typography, and accessibility styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrapping the root component.",
  "frontend/src/pages/CategoryGalleryPage.tsx": "Displays a category-specific image gallery with SEO setup, image validation, and a lightbox viewer, redirecting home if the category slug is invalid.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with SEO config, a banner carousel, category grid, and feature highlights section.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and container settings with plugins enabled.",
  "project_state.json": "Project state file outlining the website’s goals, architectural notes, known issues, and existing implemented features."
}