{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report containing no features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files and assets.",
  "frontend/.gitignore": "Git ignore rules for logs, node_modules, build artifacts, editor files, and Netlify ZIPs.",
  "frontend/index.css": "Global stylesheet; content empty in this snapshot.",
  "frontend/index.html": "Main HTML entry with SEO metadata, Google verification tag, fonts, and script mount point.",
  "frontend/NETLIFY_DEPLOY.md": "Guide for exporting and deploying the frontend to Netlify.",
  "frontend/netlify.toml": "Netlify config specifying build command, publish directory, and SPA redirect rules.",
  "frontend/public/_redirects": "SPA redirect rule mapping all paths to index.html.",
  "frontend/public/googlecdab296682a0e0eb.html": "Google Search Console verification HTML file.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and pointing to sitemap URL.",
  "frontend/scripts/export-netlify-zip.mjs": "Build-and-zip script that validates output files and creates a Netlify-ready ZIP archive.",
  "frontend/scripts/verify-google-site-verification.mjs": "Script checking Google verification meta tags and presence of required Netlify files.",
  "frontend/SECURITY.md": "Security best practices and required headers for Internet Computer deployment.",
  "frontend/src/App.tsx": "Main React router setup with layout, routes, header, side menu, contact buttons, and footer.",
  "frontend/src/components/BannerCarousel.tsx": "Auto-playing, pausable banner carousel with navigation arrows and dot indicators.",
  "frontend/src/components/CategoryGrid.tsx": "Responsive grid of category cards linking to category pages, filtering invalid images.",
  "frontend/src/components/FloatingContactButtons.tsx": "Renders floating phone and WhatsApp action buttons using site data links.",
  "frontend/src/components/Header.tsx": "Sticky header showing menu toggle, brand name, and service locations.",
  "frontend/src/components/icons.tsx": "Exports SVG icon components for common UI actions.",
  "frontend/src/components/Lightbox.tsx": "Full‑screen image viewer with next/previous navigation and keyboard controls.",
  "frontend/src/components/ServiceAreasPopularSearches.tsx": "Static section listing service areas and SEO‑focused descriptions.",
  "frontend/src/components/SideMenu.tsx": "Slide‑in mobile menu listing categories and a call button with close/escape handling.",
  "frontend/src/config/siteData.ts": "Defines site metadata, contact info, and category list with slugs and images.",
  "frontend/src/config/siteMedia.ts": "Provides banner images and gallery image lists for each category.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Contains no logic and exports nothing, serving as a placeholder since the backend has no query methods.",
  "frontend/src/hooks/useSeo.ts": "Custom hook that updates document title, meta tags, Open Graph, Twitter tags, and canonical link based on provided SEO options.",
  "frontend/src/index.css": "Tailwind base styles and extensive custom theme variables defining light/dark color palettes, typography, and accessibility rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/CategoryGalleryPage.tsx": "Displays a category-specific balloon decoration gallery with SEO settings, navigation, image filtering, and lightbox support.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing banners, category grid, service sections, and SEO metadata setup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, shadows, and animations based on custom CSS variables.",
  "project_state.json": "Tracks project metadata, pending feature requests, and deployment-related requirements for generating Netlify-ready builds."
}