{
  "kind": "build_request",
  "title": "Remove banners 4–6 and remove any 'AI' wording from generated image set",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Update the homepage banner carousel media list to remove Banner #4, #5, and #6 (i.e., remove the 4th, 5th, and 6th entries from `siteMedia.banners`) so only Banners #1–#3 remain in the slider.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Banner 4,5,6 remove"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/config/siteMedia.ts` has exactly 3 entries in `siteMedia.banners` (the previous entries #4–#6 are removed).",
        "The homepage banner carousel shows only 3 banners and continues to autoplay/navigate correctly.",
        "No console errors occur due to banner list length changes."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Ensure the word \"AI\" (case-insensitive) is not mentioned anywhere in the app’s user-facing text or image metadata, and is not present in any generated image filenames or asset paths used by the UI (including banner images, gallery images, OG image paths, and any alt text templates).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "all ai image set not be mention ai word"
        ]
      },
      "acceptanceCriteria": [
        "No user-facing UI text contains the word \"AI\".",
        "No image `src` paths referenced by the UI contain \"ai\" (e.g., `/assets/generated/ai-...` must be replaced with non-\"ai\" filenames).",
        "No `alt` text generated by components (banner, grid, lightbox, gallery) contains the word \"AI\".",
        "Open Graph/Twitter image paths used by SEO do not contain \"ai\"."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Replace the currently-referenced generated images for the Birthday, Anniversary, Welcome Baby, and Car Boot Decor galleries (and the 3 homepage banners) with new photo-style static images whose filenames do not include \"ai\", and update `frontend/src/config/siteMedia.ts` to use the new filenames. Ensure these galleries still have multiple images each after the replacement.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "And all ai image generate birthday,anniversary,welcome baby ,home decor,cardecor, all ai image set not be mention ai word"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/config/siteMedia.ts` no longer references any `/assets/generated/ai-banner-*.png` or `/assets/generated/ai-gallery-*.png` paths.",
        "The Birthday, Anniversary, Welcome Baby, and Car Boot Decor category gallery pages render with multiple images and do not show the empty-state message under normal navigation.",
        "The homepage banner carousel renders using the new non-\"ai\" banner filenames.",
        "All newly-added generated image files are stored as static assets under `frontend/public/assets/generated/` and are referenced via `/assets/generated/...` paths."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep the existing category slugs, routing, and overall page structure intact (no new categories or route changes).",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Adding new navigation categories (e.g., creating a new \"Home Decor\" route/category).",
    "Introducing new backend storage or admin tooling for managing banners/galleries.",
    "Changing the carousel behavior, timing, or controls beyond what is necessary to remove banners #4–#6 and update image references."
  ],
  "imageRequirements": {
    "required": [
      "Realistic balloon decoration banner photo with warm premium lighting, indoor celebration setup (banner-1.dim_1600x900.png)",
      "Realistic birthday balloon arch and party backdrop photo style, high detail (banner-2.dim_1600x900.png)",
      "Realistic anniversary balloon decor scene photo style, elegant colors, high detail (banner-3.dim_1600x900.png)",
      "Realistic birthday balloon decoration scene photo style, square crop (gallery-birthday-1.dim_1200x1200.png)",
      "Realistic anniversary balloon decoration scene photo style, square crop (gallery-anniversary-1.dim_1200x1200.png)",
      "Realistic welcome baby balloon decoration scene photo style, square crop (gallery-welcome-baby-1.dim_1200x1200.png)",
      "Realistic home balloon decor setup photo style, square crop (gallery-home-decor-1.dim_1200x1200.png)",
      "Realistic car boot balloon decor setup photo style, square crop (gallery-car-decor-1.dim_1200x1200.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}