{
  "kind": "build_request",
  "title": "Ensure banner auto-slide is enabled and remove 'delivery' wording from site copy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Ensure the homepage banner carousel auto-slides (autoplays) by default when there are 2+ banner images configured, while keeping existing pause-on-user-interaction behavior (hover/focus/touch interaction should pause and manual next/previous controls should still work).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Banner auto slide karde bhai"
        ]
      },
      "acceptanceCriteria": [
        "On the homepage, when `siteMedia.banners.length >= 2`, the banner advances automatically on a timer without requiring user input.",
        "Carousel autoplay is not paused by default on initial page load.",
        "Manual navigation (previous/next buttons and dots) continues to work and does not break autoplay.",
        "When the user interacts (hover/focus) the carousel pauses, and it resumes afterward (current behavior preserved)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Remove the word \"delivery\" from all user-facing website copy and replace it with service-appropriate wording in English (use \"on-time service\" and/or \"on-time setup\" depending on context), ensuring the site reads like a service website.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "delivery remove krde service on time kr service website hai"
        ]
      },
      "acceptanceCriteria": [
        "No user-facing text anywhere in the frontend contains the word \"delivery\" (case-insensitive).",
        "The homepage \"Why Choose Us\" section replaces the phrase \"on-time delivery\" with \"on-time service\" (or \"on-time setup\") while keeping the sentence grammatically correct.",
        "All updated text remains in English and matches the existing marketing tone."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (Shadcn read-only components).",
    "Do not modify files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Keep existing routes and navigation structure unchanged."
  ],
  "nonGoals": [
    "Adding new pages, new categories, or changing the banner images list/content beyond what is required to ensure autoplay works.",
    "Backend changes (Motoko) are not required for these updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}