{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Homepage banner autoplay enablement and copy update to remove 'delivery'",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Enable homepage banner carousel autoplay by default when 2+ banners exist, preserving pause-on-interaction and manual navigation behavior.",
      "acceptanceCriteria": [
        "On the homepage, when `siteMedia.banners.length >= 2`, the banner advances automatically on a timer without requiring user input.",
        "Carousel autoplay is not paused by default on initial page load.",
        "Manual navigation (previous/next buttons and dots) continues to work and does not break autoplay.",
        "When the user interacts (hover/focus) the carousel pauses, and it resumes afterward (current behavior preserved)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BannerCarousel.tsx",
          "operation": "modify",
          "description": "Adjust carousel pause/autoplay logic to ensure autoplay runs by default when there are 2+ banners, and expand interaction pausing to reliably cover hover, focus-within, and touch/pointer interactions while keeping existing next/previous buttons and dot navigation working alongside autoplay."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Remove 'delivery' wording from all user-facing copy and replace with service-appropriate English phrasing ('on-time service'/'on-time setup').",
      "acceptanceCriteria": [
        "No user-facing text anywhere in the frontend contains the word \"delivery\" (case-insensitive).",
        "The homepage \"Why Choose Us\" section replaces the phrase \"on-time delivery\" with \"on-time service\" (or \"on-time setup\") while keeping the sentence grammatically correct.",
        "All updated text remains in English and matches the existing marketing tone."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the homepage 'Why Choose Us' copy to replace 'on-time delivery' with service-appropriate wording (e.g., 'on-time service' and/or 'on-time setup') and ensure no remaining user-facing 'delivery' text remains in this view."
        }
      ]
    }
  ]
}